12/data/attachments/3e01407350f06571.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_e6047ca8-1a63-4f76-ad3e-5ec3ea4a7291</nif:username>
            <nif:friendToBeAdded>Geoffrey_deal_Friend_36053_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>